{  "type" : "record",  "name" : "LoanExtraPaymentProcessChanged",  "namespace" : "cz.mpss.api.starbuild.mortgageworkflow.mortgageprocessevents.v1",  "doc" : "Schema belongs to API MortgageProcessEvents.v1. Root type description: Process represents of one process instance. Process is a group of related activities that fulfills goal and delivers clearly specified value to a customer (process output).. ## General entity for any event. CDM entity name(s): Process,Event.",  "fields" : [ {    "name" : "case",    "type" : {      "type" : "record",      "name" : "Case",      "namespace" : "cz.mpss.api.starbuild.mortgageworkflow.mortgageprocessevents.v1.loanextrapaymentprocesschanged",      "doc" : "Obchodni pripadCase is group of activities or record about them that is from business perspective perceived as of enough importance to be recorded, monitored a informed about.Can be any bank's agenda.E.g. fufilling client's request, sale of one productExamples:- consumer loan origination- loan drawing- administrative action on the product- recovery- complaint handlingCase has some attributes, that are common for any case category and are mandatory. Additionally, specific case categories can have additional data.In wmt it is called business request (there is child entity for it).. ## Case that encompasses process(es) related to loan risk assessmentC4M: Business Case. CDM entity name(s): Case,LoanRiskCase.",      "fields" : [ {        "name" : "caseId",        "type" : {          "type" : "record",          "name" : "CaseId",          "doc" : "Multiattribute representing unique identifier of case.It is multiattribute because there is multiple case management solutions running now. CDM entity name(s): CaseId.",          "fields" : [ {            "name" : "id",            "type" : {              "type" : "string",              "avro.java.string" : "String",              "pattern" : "^.{0,36}$"            },            "doc" : "Unique identifier of case id itself. CDM attribute class name: CaseIdId. Attribute has simple type ST_String36 with description: General string of max length 36."          } ]        }      }, {        "name" : "loanRiskCase",        "type" : {          "type" : "record",          "name" : "RiskBusinessCaseId",          "fields" : [ {            "name" : "id",            "type" : {              "type" : "string",              "avro.java.string" : "String"            }          } ]        }      }, {        "name" : "mortgageInstance",        "type" : {          "type" : "record",          "name" : "MortgageInstance",          "doc" : "Mortgage product instance. CDM entity name(s): MortgageInstance.",          "fields" : [ {            "name" : "Starbuild",            "type" : {              "type" : "record",              "name" : "StarbuildInstanceId",              "doc" : "Multiattribute property of marketable item instance.Multiattribute: Identifiers of marketable item instances are not yet unified, there is no one central catalogue.This also covers identifiers valid for only some part of marketable item instance lifecycle, e.g. proposed product.E.g. PCP identifiers, TSS identifiers.#CZ#Viceatributova promenna instanci prodejnych polozek. Viceatributovost: Identifikatory instanci prodejych polozek zatim nejsou sjednoceny. Neexistujce centralni katalog. Pokryva tez identifikatory, ktere jsou platne pouze pro nektere casti zivotniho cyklu instanci prodejnych polozek (napriklad navrhovany produkt). Priklad: PCP identifikator, TSS identifikator. CDM entity name(s): InstanceId.",              "fields" : [ {                "name" : "id",                "type" : {                  "type" : "string",                  "avro.java.string" : "String",                  "pattern" : "^.{0,30}$"                },                "doc" : "Identifier of product instance item itself.#CZ#Vlastni identifikator instance prodejne polozky. CDM attribute class name: InstanceIdId. Attribute has simple type ST_IdStringDefault with description: Standard data type to be used ID, i.e. unique identifier. It is not supposed to be human-readable.E.g.: AgreementID"              } ]            }          } ]        }      } ]    }  }, {    "name" : "currentTask",    "type" : {      "type" : "record",      "name" : "CurrentTask",      "namespace" : "cz.mpss.api.starbuild.mortgageworkflow.mortgageprocessevents.v1.loanextrapaymentprocesschanged",      "doc" : "Task is a unit of work that usually performs 1 role in 1 time in 1 place.Lombardi: task instance, wmt:.... CDM entity name(s): Task.",      "fields" : [ {        "name" : "id",        "type" : {          "type" : "string",          "avro.java.string" : "String",          "pattern" : "^.{0,50}$"        },        "doc" : "Identifier of a task instance within a 'BPM' system where task originates. Not unique across BPM system instances.In IBM BAW also known as: tkiid, taskId. CDM attribute class name: TaskId. Attribute has simple type ST_String50 with description: General string of max length 50."      }, {        "name" : "name",        "type" : {          "type" : "string",          "avro.java.string" : "String",          "pattern" : "^.{0,255}$"        },        "doc" : "Runtime name of the task. Typically,  what is presented to users in task/work queue.In IBM BAW also known as: subject.Note: Limited to 255 chars due to column definition in BAW internal database (BPMDB). CDM attribute class name: TaskName. Attribute has simple type ST_String255 with description: General string of max length 255."      }, {        "name" : "type",        "type" : "int"      } ]    }  }, {    "name" : "eventId",    "type" : {      "type" : "string",      "avro.java.string" : "String",      "pattern" : "^.{0,100}$"    },    "doc" : ".Unique identifier of event. CDM attribute class name: EventId. Attribute has simple type ST_String100 with description: General string of max length 100."  }, {    "name" : "id",    "type" : {      "type" : "string",      "avro.java.string" : "String",      "pattern" : "^.{0,128}$"    },    "doc" : "Unique identifier of process instance within a workflow system. CDM attribute class name: ProcessId. Attribute has simple type ST_String128 with description: General string of max length 128"  }, {    "name" : "name",    "type" : {      "type" : "string",      "avro.java.string" : "String",      "pattern" : "^.{0,400}$"    },    "doc" : "Name of the process instance, created at runtime. CDM attribute class name: ProcessName. Attribute has simple type ST_String400 with description: General string of max length 400."  }, {    "name" : "occurredOn",    "type" : {      "type" : "long",      "logicalType" : "local-timestamp-millis"    },    "doc" : "Date and time when event occurred. CDM attribute class name: EventOccurredOn. Standard avro dateTime represented by the number of milliseconds from the unix epoch, see avro specification: https://avro.apache.org/docs/1.8.0/spec.html. Consider using converters to dateTime class in code generator (see KB Integration Platform wiki for schema registry chapter)."  }, {    "name" : "processData",    "type" : {      "type" : "record",      "name" : "ProcessData",      "namespace" : "cz.mpss.api.starbuild.mortgageworkflow.mortgageprocessevents.v1.loanextrapaymentprocesschanged",      "doc" : "Process data represent data that are needed for the process execution. For example to guide flow of the process based on data.These are typically needed on the 'edges' of activities in the process. Edge meaning when a task is 'entered (input variables)' and 'exited (output variables)'. CDM entity name(s): ProcessData.",      "fields" : [ {        "name" : "private",        "type" : {          "type" : "record",          "name" : "BusinessObject",          "doc" : "Data that the task or process carries 'inside'. These are typically data that are needed for process or task runtime, such as used in UIs, make business decisions inside the process or to integrate external services and interfaces. CDM entity name(s): BusinessObject.",          "fields" : [ {            "name" : "loanExtraPaymentProcessData",            "type" : {              "type" : "record",              "name" : "LoanExtraPaymentProcessData",              "fields" : [ {                "name" : "processPhase",                "type" : {                  "type" : "record",                  "name" : "ProcessPhase",                  "fields" : [ {                    "name" : "code",                    "type" : "int"                  }, {                    "name" : "name",                    "type" : {                      "type" : "string",                      "avro.java.string" : "String",                      "pattern" : "^.{0,255}$"                    },                    "doc" : " Attribute has simple type ST_String255 with description: General string of max length 255."                  } ]                }              } ]            }          } ]        }      } ]    }  }, {    "name" : "state",    "type" : {      "type" : "enum",      "name" : "ProcessStateEnum",      "symbols" : [ "ACTIVE", "COMPLETED", "DELETED", "FAILED", "SUSPENDED", "TERMINATED" ]    },    "doc" : "Runtime state of the process within the BPM engine. More of a lifecycle state of the process intance within the BPM engine.Not necesarilly 'business' state of the process.  CDM attribute class name: ProcessStateV2."  }, {    "name" : "type",    "type" : "int"  } ],  "javaAnnotation" : "cz.kb.api.common.annotation.ConfluentSchemaRegistryCompatible"}